{
    "source": "https://minecraft.gamepedia.com/Pocket_Edition_Alpha_0.7.4",
    "additions": [
        "Added an 'External' button in the edit section of world create menu, for IP-connecting to servers",
        "Added a very faint sound when tools break, as well as a sound when flint and steel is used",
        "Tapping and holding flint and steel on a creeper will cause the creeper to start explosion countdown",
        "Added support for commands, however when attempting to use any command 'Error: Command not found' displays",
        "Added chiseled quartz to survival mode",
        "The moon now has different phases"
    ],
    "changes": [
        "Clouds are now slightly darker, to correspond to the cloud color in PC",
        "The orbit size of the sun and moon around the player has been increased, fixing a sun and moon size problem, as well as the sun appearing in front of the clouds",
        "After eating food, a burp can be heard",
        "Eggs can be thrown rapidly if you keep on tapping and holding the screen in both creative and survival",
        "Each message displayed by the server now has a tag (e.g. 'Disconnected from server' now reads '<error> Disconnected from server')",
        "Flint and steel now produces sound when used",
        "Fire now has idle sounds when the player is within proximity"
    ],
    "fixes": [
        "MCPE-4926: The Splash now changes every time a world is quit",
        "MCPE-4925: The sun now disappears during night and vice versa",
        "MCPE-156: After eating one food item, player starts breaking things with food",
        "MCPE-228: Top half a door can replace a non-air block",
        "MCPE-480: The crafting menu don't show numbers for damaged tools!",
        "MCPE-754: Respawning at the edge of the world",
        "MCPE-1022: Player can eat extra food while moving",
        "MCPE-1221: Uncraftable quartz items",
        "MCPE-1222: Missing name for quartz stairs",
        "MCPE-1615: No Sandstone stairs in survival mode",
        "MCPE-1667: Armour and Health Icons obstruct sign menu",
        "MCPE-1709: the armor does not drop when you die",
        "MCPE-1715: Signs don't drop as items",
        "MCPE-1743: Cannot destroy signs",
        "MCPE-1771: I have two furnaces and one of the when I tap on it to cook food and stuff it will crash and when I try to break it, it also will crash",
        "MCPE-1853: Mushroom farming is not working",
        "MCPE-1955: Text on Signs is weird / Sign letters are erased when you write numbers or exclamation marks",
        "MCPE-2326: Odd problem with 6 on signs",
        "MCPE-2475: Milk bucket fills in creative, but then no empty bucket to pick up water/lava",
        "MCPE-2480: Buckets not named correctly",
        "MCPE-2807: fire doesn't burn fences wooden slaps stairs crafting table or chest",
        "MCPE-2993: when I in login to realms it doesn't save the login when going back app then it doesn't let me to log in so I have to close the app. (Galaxy Tablet 2 7.0)",
        "MCPE-3043: Cannot take damage with arrows when wearing armour",
        "MCPE-3098: Chunks not marked dirty by data-only changes (was infinite cake)",
        "MCPE-3684: Crashes when putting on armor",
        "MCPE-3857: Empty buckets can destroy water blocks (Survival and Creative)",
        "MCPE-3863: you can still live in the void",
        "MCPE-3955: bug regarding collecting milk with a stack of buckets",
        "MCPE-3960: Filled buckets are stackable (Since 0.7.1)",
        "MCPE-3987: Buckets disappear while picking up water with full inventory / Buckes go to inventory while filling",
        "MCPE-4193: Leaves disappear",
        "MCPE-4291: My friend put on armor and then it said he had no armor in the top right but he was wearing armor",
        "MCPE-4340: lava buckets as fuel",
        "MCPE-4346: Items in inventory deleted when leaving and then re-joining Pocket Realms",
        "MCPE-4450: Realm Unjoinable after Nether Reactor Crash!",
        "MCPE-4456: Nether Reactors Cause Realm Server to Crash",
        "MCPE-4472: Nasty glitch may allow users to make other people accounts unplayable",
        "MCPE-4533: Minecraft pe crashes when you try to type in emoji symbols into chat on ipad",
        "MCPE-4554: Inventory doesn't drop when you die on Realms",
        "MCPE-4556: Limited Unicode characters on Signs",
        "MCPE-4591: Crafting Table and Furnace glitch. Can't get any crafted items",
        "MCPE-4651: Fire has no crackling sound",
        "MCPE-4661: Cake floats when the blocks it's resting on is broken",
        "MCPE-4752: Armor bug",
        "MCPE-4758: My MCPE crashes when I touch the armor button.",
        "MCPE-4778: There is a bug when you are looking in a chest. If a creeper blows up when you look in a chest Minecraft crashes",
        "MCPE-4803: Armor damage bug",
        "MCPE-4866: Chest show side texture in hand and on ground",
        "MCPE-4869: Wrong items counter in crafting table",
        "MCPE-4878: Hitting the 'back' key while in a Chest GUI sends you to the title screen",
        "MCPE-4891: Chests 'shake' while breaking",
        "MCPE-4901: After you die,there is a empty inventory added in the first part",
        "MCPE-4912: Chest noises not synced",
        "MCPE-4914: Chests lighting",
        "MCPE-4915: In wifi multiplayer, double chests do not work for the person that joins",
        "MCPE-4919: can't place trapdoor on wooden slab",
        "MCPE-4925: When going hig in the sky, you can see the moon beneath you",
        "MCPE-4926: Splash Texts don't change",
        "MCPE-4931: wooden half slab recipe only gives one slab",
        "MCPE-4947: Not hearing chest sounds in LAN",
        "MCPE-4949: Chests are shown, but they are a non solid block",
        "MCPE-4963: Loging out of realms",
        "MCPE-4978: Buckets disapear when filled up with water",
        "MCPE-4999: Can't type capital 'w' in world name or in seed",
        "MCPE-5006: The blocks look strange in your hand in third person view",
        "MCPE-5021: No Moon Phases",
        "MCPE-5028: Double chests freeze and crash in multiplayer",
        "MCPE-5076: Leave bed button disappears after pressing back button",
        "MCPE-5100: Buckets - Scrolling Hotbar Issue"
    ]
}
